Дошкольное_учреждение83/src/Documents/удуНачислениеРП/удуНачислениеРП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>удуНачислениеРП</name>
  <registerRecords>AccumulationRegister.удуВзаиморасчетыСРодителями</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Учреждение</name>
    <type>
      <types>CatalogRef.удуУчреждения</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокНачислений</name>
    <attributes>
      <name>Ребенок</name>
      <type>
        <types>CatalogRef.удуДети</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПосещеноДней</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Группа</name>
      <type>
        <types>CatalogRef.удуГруппыУчреждения</types>
      </type>
    </attributes>
    <attributes>
      <name>Договор</name>
      <type>
        <types>DocumentRef.удуДоговорОЗачисленииРебенка</types>
      </type>
    </attributes>
    <attributes>
      <name>РабочихДней</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Дошкольное_учреждение83/src/AccumulationRegisters/удуВзаиморасчетыСРодителями/удуВзаиморасчетыСРодителями.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>удуВзаиморасчетыСРодителями</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Учреждение</name>
    <type>
      <types>CatalogRef.удуУчреждения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ребенок</name>
    <type>
      <types>CatalogRef.удуДети</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Дошкольное_учреждение83/src/Documents/удуНачислениеРП/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.удуВзаиморасчетыСРодителями.Записывать = Истина;	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	удуНачислениеРПСписокНачислений.Ребенок,
	|	СУММА(удуНачислениеРПСписокНачислений.Сумма) КАК Сумма
	|ИЗ
	|	Документ.удуНачислениеРП.СписокНачислений КАК удуНачислениеРПСписокНачислений
	|ГДЕ
	|	удуНачислениеРПСписокНачислений.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	удуНачислениеРПСписокНачислений.Ребенок";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Учреждение", Учреждение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			Движение = Движения.удуВзаиморасчетыСРодителями.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Учреждение = Учреждение;
			ЗаполнитьЗначенияСвойств(Движение,Выборка);			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры
